# pandas 데이터 프레임 인덱서

In [1]:
import numpy as np
import pandas as pd

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

## 데이터 프레임 인덱서 : loc, iloc

### 데이터 프레임 인덱싱

1. 열인덱싱
2. 행인덱싱
3. 개별요소 접근


### 데이터 프레임에서 인덱서 사용

## 1. loc 인덱서 (행 우선 인덱서)

In [3]:
df = pd.DataFrame(np.arange(10,22).reshape(3,4), index=['a','b','c'], columns = 'A B C D'.split())
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

문제 1. 행우선 인덱서 이므로 ~

In [4]:
# loc 인덱서 : 인덱싱 값을 하나만 받는 경우
df.loc['a']
# 출력 결과 : 시리즈로 반환

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [5]:
# b행부터 c행의 모든 열 반환
df.loc['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [6]:
df['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [8]:
df.loc[['b','c']]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [10]:
df.loc[['a','c']]

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

In [12]:
df.loc['b']

A    14
B    15
C    16
D    17
Name: b, dtype: int32

In [13]:
# 컬럼명에 B,C가 존재
df[['B','C']]

    B   C
a  11  12
b  15  16
c  19  20

In [14]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [15]:
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [16]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [17]:
df[df.A > 15]

    A   B   C   D
c  18  19  20  21

* 인덱스 대신 인덱스 값을 반환하는 함수 사용

In [20]:
# 함수 작성
def sel_row(df):
    return df.A > 15
# True 나 False반환

In [22]:
df2 = pd.DataFrame(np.arange(10,26).reshape(4,4), columns = ['a','b','c','d'])
df2

    a   b   c   d
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [23]:
# 값 인덱싱
df2.loc[1:2]

    a   b   c   d
1  14  15  16  17
2  18  19  20  21

In [24]:
# 위치 인덱싱
df2[1:2]

    a   b   c   d
1  14  15  16  17

In [25]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [26]:
# a 행의 A열
df.loc['a','A']

10

In [27]:
df.loc['a','A']=50
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

1. a행의 모든 열 반환

In [28]:
# 시리즈 형태로 반환
df.loc['a']

A    50
B    11
C    12
D    13
Name: a, dtype: int32

In [30]:
# 데이터 프레임 형태로 반환
df.loc[['a']]

    A   B   C   D
a  50  11  12  13

In [31]:
df.loc['a',:]

A    50
B    11
C    12
D    13
Name: a, dtype: int32

In [32]:
# a행의 B,C의 열을 반환
df.loc['a','B':'C']

B    11
C    12
Name: a, dtype: int32

In [34]:
# b행부터 모든 행의 A열을 반환
df.loc['b':,'A']

b    14
c    18
Name: A, dtype: int32

In [40]:
# a와 b행의 모든 열을 df형태로 반환
df.loc[['a','b']]

    A   B   C   D
a  50  11  12  13
b  14  15  16  17

In [41]:
# a,b 행의 모든열 df 형태로 반환
df.loc['a':'b']

    A   B   C   D
a  50  11  12  13
b  14  15  16  17

In [45]:
# a,b 행의 B열을 시리즈 반환
df.loc[['a','b'],'B']

a    11
b    15
Name: B, dtype: int32

In [44]:
# a,b 행의 B열을 df 형태로 반환
df.loc['a':'b','B']

a    11
b    15
Name: B, dtype: int32

In [46]:
df.loc[['a','b'],['B','D']]

    B   D
a  11  13
b  15  17

iloc

In [47]:
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [48]:
# 0행 1열
df.iloc[0,1]

11

In [49]:
# df형태로 반환 - 슬라이싱 사용
df.iloc[0:2,1:2]

    B
a  11
b  15

In [50]:
# 시리즈형태로 반환 - 슬라이싱, 위치값 사용
df.iloc[0:2,1]

a    11
b    15
Name: B, dtype: int32

In [51]:
# 0행의 2번째 열부터 끝열까지 반환
df.iloc[0,2:]

C    12
D    13
Name: a, dtype: int32

In [53]:
# 0행의 끝에서 두번째 열 이후까지 반환
df.iloc[0,-2:] # 시리즈 형태
df.iloc[0:1,-2:] # df 형태

C    12
D    13
Name: a, dtype: int32

    C   D
a  12  13

- iloc[행위치,열위치] -> 원소값 반환
- iloc[행위치1:행위치2,열위치1:열위치2] -> 원소 반환: df 반환
- iloc[행위치,열위치1:열위치2] -> 원소반환 :시리즈 반환
- iloc[행위치1:행위치2,열위치]->원소반환 : 시리즈 반환

연습문제

In [57]:
# 25,50 범위 5행 5열로 배치
df = pd.DataFrame(np.arange(25,50).reshape(5,5),
                 index=['a','b','c','d','e'],
                 columns=['A','B','C','D','E'])
df

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39
d  40  41  42  43  44
e  45  46  47  48  49

In [76]:
# A열 추출
df.iloc[0:,0]

a    25
b    30
c    35
d    40
e    45
Name: A, dtype: int32

In [ ]:
# 다른 사람이 한 것
# A열 추출
df['A'] # 시리즈형태
df.loc[:]['A'] # 시리즈형태
df.loc[:,:'A'] # 데이터프레임 형태
df.iloc[:,:1] # 데이터프레임 형태
df.iloc[:,0] # 시리즈형태

In [83]:
# 0행부터 2행까지 추출
df.iloc[:3]

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39

In [85]:
# 1행의 3,4열 추출
df.iloc[:1,3:5]
df.iloc[[1],[3,4]]

    D   E
a  28  29

    D   E
b  33  34

In [86]:
# a행에서 c행까지 중 B열과 D열 추출
df['a':'c'][['B','D']]

df.loc['a':'c', ['B','D']]

df.iloc[0:3, [1,3]]

    B   D
a  26  28
b  31  33
c  36  38

    B   D
a  26  28
b  31  33
c  36  38

    B   D
a  26  28
b  31  33
c  36  38